FILES/Catalogs/ДополнительныеОтчетыИПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ДополнительныеОтчетыИПечатныеФормы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуОтладки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйФункционал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныйФункционал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъектуМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СразуНаПечать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяИсходнойКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Catalogs/ДополнительныеОтчетыИПечатныеФормы/Ext/ManagerModule.bsl
Функция ПолучитьКомандыПоОбъекту(ПутьКОбъекту, Вид = ".epf") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка КАК Ссылка,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПредставлениеОбъекта КАК ПредставлениеОбъекта,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПутьКОбъектуМетаданных КАК ПутьКОбъектуМетаданных,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.ИмяКоманды КАК ИмяКоманды,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.ПредставлениеКоманды КАК ПредставлениеКоманды
	               |ИЗ
	               |	Справочник.ДополнительныеОтчетыИПечатныеФормы.СписокОбъектов КАК ДополнительныеОтчетыИПечатныеФормыСписокОбъектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИПечатныеФормы.СписокКоманд КАК ДополнительныеОтчетыИПечатныеФормыСписокКоманд
	               |		ПО ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка = ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Ссылка
	               |ГДЕ
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Использовать = ИСТИНА
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПутьКОбъектуМетаданных ПОДОБНО &ПутьКОбъектуМетаданных
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.Вид = &Вид
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.Использовать = ИСТИНА";
	Запрос.УстановитьПараметр("ПутьКОбъектуМетаданных", ПутьКОбъекту);
	Запрос.УстановитьПараметр("Вид", Вид);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

Функция ПолучитьВсеКомандыПоОбъекту(ПутьКОбъекту, Вид = ".epf") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка КАК Ссылка,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПредставлениеОбъекта КАК ПредставлениеОбъекта,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПутьКОбъектуМетаданных КАК ПутьКОбъектуМетаданных,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.ИмяКоманды КАК ИмяКоманды,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Использовать
	               |		ИЛИ ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.Использовать КАК Использовать
	               |ИЗ
	               |	Справочник.ДополнительныеОтчетыИПечатныеФормы.СписокОбъектов КАК ДополнительныеОтчетыИПечатныеФормыСписокОбъектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИПечатныеФормы.СписокКоманд КАК ДополнительныеОтчетыИПечатныеФормыСписокКоманд
	               |		ПО ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка = ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Ссылка
	               |ГДЕ
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПутьКОбъектуМетаданных ПОДОБНО &ПутьКОбъектуМетаданных
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.Вид = &Вид
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ПутьКОбъектуМетаданных", ПутьКОбъекту);
	Запрос.УстановитьПараметр("Вид", Вид);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции


Функция ПолучитьМакетОбъекта(ПутьКОбъекту) Экспорт
	
		
	
КонецФункции
